// pages/b/b.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    array:{
      list:[{
        title: '注射器',
        type: '可回收垃圾',
        a: ["湿垃圾", "干垃圾", "可回收垃圾", "有害垃圾"]
      }, {
        title: '空调消毒液瓶',
        type:'干垃圾',
        a: ["湿垃圾", "干垃圾", "可回收垃圾", "有害垃圾"]
      }, {
        title: '脏纸尿裤',
        type: '干垃圾',
        a: ["湿垃圾", "干垃圾", "可回收垃圾", "有害垃圾"]
      }, {
        title: '手臂包',
        type: '可回收垃圾',
        a: ["湿垃圾", "干垃圾", "可回收垃圾", "有害垃圾"]
      }, {
        title: '玻璃制品',
        type: '可回收垃圾',
        a: ["湿垃圾", "干垃圾", "可回收垃圾", "有害垃圾"]
      }, {
        title: '茅台空酒瓶',
        type: '可回收垃圾',
        a: ["湿垃圾", "干垃圾", "可回收垃圾", "有害垃圾"]
      }, {
        title: '电子塑料包装',
        type: '可回收垃圾',
        a: ["湿垃圾", "干垃圾", "可回收垃圾", "有害垃圾"]
      }, {
        title: '水笔',
        type: '干垃圾',
        a: ["湿垃圾", "干垃圾", "可回收垃圾", "有害垃圾"]
      }, {
        title: '试卷',
        type: '可回收垃圾',
        a: ["湿垃圾", "干垃圾", "可回收垃圾", "有害垃圾"]
      }, {
        title: '厨余果皮',
        type: '湿垃圾',
        a: ["湿垃圾", "干垃圾", "可回收垃圾", "有害垃圾"]
      }],
    },
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})